#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/testimg/learn-terraform-github-actions-azure/runs/run-xVesGvtdiTfae6MQ

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/b2020ded-fdab-492a-91e0-b4e04d9ef6df/resourceGroups/fuat-terraform-experiment]
azurerm_public_ip.publicip: Refreshing state... [id=/subscriptions/b2020ded-fdab-492a-91e0-b4e04d9ef6df/resourceGroups/fuat-terraform-experiment/providers/Microsoft.Network/publicIPAddresses/publicip1]
azurerm_network_security_group.nsg: Refreshing state... [id=/subscriptions/b2020ded-fdab-492a-91e0-b4e04d9ef6df/resourceGroups/fuat-terraform-experiment/providers/Microsoft.Network/networkSecurityGroups/nsg]
azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/b2020ded-fdab-492a-91e0-b4e04d9ef6df/resourceGroups/fuat-terraform-experiment/providers/Microsoft.Network/virtualNetworks/terraform-vnet]
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "ARM_CLIENT_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-xVesGvtdiTfae6MQ/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "ARM_CLIENT_SECRET" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-xVesGvtdiTfae6MQ/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│
│ In addition to the other similar warnings shown, 2 other variable(s)
│ defined without being declared.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.vm will be created
  + resource "azurerm_linux_virtual_machine" "vm" {
      + admin_password                  = (sensitive value)
      + admin_username                  = "fuatu"
      + allow_extension_operations      = true
      + computer_name                   = "terraformvm"
      + disable_password_authentication = true
      + extensions_time_budget          = "PT1H30M"
      + id                              = (known after apply)
      + location                        = "eastus"
      + max_bid_price                   = -1
      + name                            = "terraform-experiment"
      + network_interface_ids           = (known after apply)
      + patch_assessment_mode           = "ImageDefault"
      + patch_mode                      = "ImageDefault"
      + platform_fault_domain           = -1
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "fuat-terraform-experiment"
      + size                            = "Standard_B1ls"
      + virtual_machine_id              = (known after apply)

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = "osdisk"
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "20.04-LTS"
          + version   = "latest"
        }
    }

  # azurerm_network_interface.nic will be created
  + resource "azurerm_network_interface" "nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "eastus"
      + mac_address                   = (known after apply)
      + name                          = "nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "fuat-terraform-experiment"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "testconfiguration1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = "/subscriptions/b2020ded-fdab-492a-91e0-b4e04d9ef6df/resourceGroups/fuat-terraform-experiment/providers/Microsoft.Network/publicIPAddresses/publicip1"
          + subnet_id                                          = (known after apply)
        }
    }

  # azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.16.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "subnetterra"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "fuat-terraform-experiment"
      + virtual_network_name                           = "terraform-vnet"
    }

  # azurerm_virtual_network.vnet will be updated in-place
  ~ resource "azurerm_virtual_network" "vnet" {
      ~ address_space           = [
          - "172.16.0.0/29",
          + "172.16.0.0/22",
        ]
        id                      = "/subscriptions/b2020ded-fdab-492a-91e0-b4e04d9ef6df/resourceGroups/fuat-terraform-experiment/providers/Microsoft.Network/virtualNetworks/terraform-vnet"
        name                    = "terraform-vnet"
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

```

</details>

*Pushed by: @fuatu, Action: `pull_request`*